RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_usart.c
#define USART_TXD(_UNITx_)              ((__IO uint16_t *)USART_TXD_ADDR(_UNITx_))
#define USART_RXD(_UNITx_)              ((__IO uint16_t *)USART_RXD_ADDR(_UNITx_))
/**
 * @}
 */

/**
 * @defgroup USART_Redefine_Bits USART Redefine Bits
 * @{
 */
#define USART_CR_SCEN                   (0x00000020UL)
#define USART_CR_FBME                   (0x20000000UL)
#define USART_BRR_DIV_FRACTION_MASK     (0x0000007FUL)
/**
 * @}
 */

/**
 * @defgroup USART_BRR_Division_Max USART BRR Register Division Max
 * @{
 */
#define USART_BRR_DIV_INTEGER_MAX       (0xFFUL)
#define USART_BRR_DIV_FRACTION_MAX      (0x7FUL)
/**
 * @}
 */

/**
 * @defgroup USART_Default_Baudrate USART Default Baudrate
 * @{
 */
#define USART_DEFAULT_BAUDRATE          (9600UL)
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @defgroup USART_Local_Functions USART Local Functions
 * @{
 */
/**
 * @brief  Try to wait the expected status of specified flags
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg CM_USARTx:            USART unit instance register base
 * @param  [in] u32Flag                 USART flag
 *         This parameter can be one of the following values:
 *           @arg USART_FLAG_RX_FULL:   Receive data register not empty flag
 *           @arg USART_FLAG_TX_CPLT:   Transmission complete flag
 *           @arg USART_FLAG_TX_EMPTY:  Transmit data register empty flag
 *           @arg USART_FLAG_OVERRUN:   Overrun error flag
 *           @arg USART_FLAG_FRAME_ERR: Framing error flag
 *           @arg USART_FLAG_PARITY_ERR:Parity error flag
 *           @arg USART_FLAG_RX_TIMEOUT: Receive timeout flag
 *           @arg USART_FLAG_MX_PROCESSOR: Receive processor ID flag
 *           @arg USART_FLAG_LIN_ERR:   LIN bus error flag
 *           @arg USART_FLAG_LIN_WKUP:  LIN wakeup signal detection flag
 *           @arg USART_FLAG_LIN_BREAK: LIN break signal detection flag
 * @param  [in] enStatus                Expected status
 *         This parameter can be one of the following values:
 *           @arg  SET:                 Wait flag set
 *           @arg  RESET:               Wait flag reset
 * @param  [in] u32Timeout              Maximum count(Max value @ref USART_Max_Timeout) of trying to get status
 * @retval int32_t:
 *           - LL_OK:                   Complete wait the expected status of the specified flags.
 *           - LL_ERR_TIMEOUT:          Wait timeout.
 * @note Block checking flag if u32Timeout value is USART_MAX_TIMEOUT.
 */
static int32_t USART_WaitStatus(const CM_USART_TypeDef *USARTx,
                                uint32_t u32Flag,
                                en_flag_status_t enStatus,
                                uint32_t u32Timeout)
{
    int32_t i32Ret = LL_OK;
    __IO uint32_t u32To = 0UL;

    DDL_ASSERT(IS_USART_UNIT(USARTx));
    DDL_ASSERT(IS_USART_FLAG(u32Flag));

    while (USART_GetStatus(USARTx, u32Flag) != enStatus) {
        /* Block checking flag if timeout value is USART_TIMEOUT_MAX */
        if ((u32To > u32Timeout) && (u32Timeout < USART_MAX_TIMEOUT)) {
            i32Ret = LL_ERR_TIMEOUT;
            break;
        }

        u32To++;
    }

    return i32Ret;
}

/**
 * @brief  Calculate baudrate integer division for UART mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg CM_USARTx:            USART unit instance register base
 * @param  [in] u32UsartClk             USART clock
 * @param  [in] u32Baudrate             UART baudrate
 * @param  [out] pu32DivInteger         Pointer to BRR integer divsion value
 * @param  [out] pf32Error              E(%) baudrate error rate
 * @retval int32_t:
 *           - LL_OK:                   Set successfully.
 *           - LL_ERR_INVD_PARAM:       Set unsuccessfully.
 */
static int32_t UART_CalculateDivInteger(const CM_USART_TypeDef *USARTx,
                                        uint32_t u32UsartClk, uint32_t u32Baudrate,
                                        uint32_t *pu32DivInteger, float32_t *pf32Error)
{
    uint32_t B;
    uint32_t C;
    uint32_t OVER8;
    uint64_t u64Temp;
    uint32_t DIV_Integer;
    float32_t f32Err;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    DDL_ASSERT(IS_USART_UNIT(USARTx));

    C = u32UsartClk;
    B = u32Baudrate;

    if ((NULL != pu32DivInteger) && (C > 0UL) && (B > 0UL)) {
        OVER8 = (0UL == READ_REG32_BIT(USARTx->CR1, USART_CR1_OVER8)) ? 0UL : 1UL;

        /* UART mode baudrate integer calculation formula:      */
        /*      B = C / (8 * (2 - OVER8) * (DIV_Integer + 1))   */
        /*      DIV_Integer = (C / (B * 8 * (2 - OVER8))) - 1   */
        DIV_Integer = ((((C * 10UL) / (B * 8UL * (2UL - OVER8))) + 5UL) / 10UL) - 1UL; /*  +5UL for rounding off */

        if (DIV_Integer <= USART_BRR_DIV_INTEGER_MAX) {
            *pu32DivInteger = DIV_Integer;

            if (NULL != pf32Error) {
                /* E(%) = C / (8 * (2 - OVER8) * (DIV_Integer + 1) * B) - 1 */

                /* u64Temp = (8 * (2 - OVER8) * (DIV_Integer + 1) * B)  */
                u64Temp = (uint64_t)((uint64_t)8UL * ((uint64_t)2UL - (uint64_t)OVER8) * ((uint64_t)DIV_Integer + \
                                     (uint64_t)1UL) * (uint64_t)B);
                f32Err = (float32_t)((float64_t)C / (float64_t)u64Temp) - 1.0F;

                *pf32Error = f32Err;
            }

