RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_usart.c
            i32Ret = LL_OK;
        }
    }

    return i32Ret;
}

/**
 * @brief  Calculate baudrate integer division for clock synchronization mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg CM_USARTx:            USART unit instance register base
 * @param  [in] u32UsartClk             USART clock
 * @param  [in] u32Baudrate             UART baudrate
 * @param  [out] pu32DivInteger         Pointer to BRR integer divsion value
 * @param  [out] pf32Error              E(%) baudrate error rate
 * @retval int32_t:
 *           - LL_OK:                   Set successfully.
 *           - LL_ERR_INVD_PARAM:       Set unsuccessfully.
 */
static int32_t ClockSync_CalculateDivInteger(const CM_USART_TypeDef *USARTx,
        uint32_t u32UsartClk, uint32_t u32Baudrate,
        uint32_t *pu32DivInteger, float32_t *pf32Error)
{
    uint32_t B;
    uint32_t C;
    float32_t f32Err;
    uint64_t u64Temp;
    uint32_t DIV_Integer;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    DDL_ASSERT(IS_USART_UNIT(USARTx));

    C = u32UsartClk;
    B = u32Baudrate;

    if ((NULL != pu32DivInteger) && (C > 0UL) && (B > 0UL)) {
        /* Clock sync mode baudrate integer calculation formula:    */
        /*          B = C / (4 * (DIV_Integer + 1))                 */
        /*          DIV_Integer = (C / (B * 4)) - 1                 */
        DIV_Integer = ((((C * 10UL) / (B * 4UL)) + 5UL) / 10UL) - 1UL; /*  +5UL for rounding off */

        if ((DIV_Integer > 0UL) && (DIV_Integer <= USART_BRR_DIV_INTEGER_MAX)) {
            *pu32DivInteger = DIV_Integer;

            if (NULL != pf32Error) {
                /* E(%) = C / (4 * (DIV_Integer + 1) * B) - 1 */

                /* u64Temp = 4 * (DIV_Integer + 1) * B */
                u64Temp = (uint64_t)((uint64_t)4U * ((uint64_t)DIV_Integer + (uint64_t)1UL) * (uint64_t)B);
                f32Err = (float32_t)((float64_t)C / (float64_t)u64Temp) - 1.0F;

                *pf32Error = f32Err;
            }

            i32Ret = LL_OK;
        }
    }

    return i32Ret;
}

/**
 * @brief  Calculate baudrate integer division for smart-card mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg CM_USARTx:            USART unit instance register base
 * @param  [in] u32UsartClk             USART clock
 * @param  [in] u32Baudrate             UART baudrate
 * @param  [out] pu32DivInteger         Pointer to BRR integer divsion value
 * @param  [out] pf32Error              E(%) baudrate error rate
 * @retval int32_t:
 *           - LL_OK:                   Set successfully.
 *           - LL_ERR_INVD_PARAM:       Set unsuccessfully.
 */
static int32_t SmartCard_CalculateDivInteger(const CM_USART_TypeDef *USARTx,
        uint32_t u32UsartClk, uint32_t u32Baudrate,
        uint32_t *pu32DivInteger, float32_t *pf32Error)
{
    uint32_t B;
    uint32_t C;
    uint32_t BCN;
    uint64_t u64Temp;
    uint32_t DIV_Integer;
    const uint16_t au16EtuClkCnts[] = {32U, 64U, 93U, 128U, 186U, 256U, 372U, 512U};
    float32_t f32Err;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    DDL_ASSERT(IS_USART_SMARTCARD_UNIT(USARTx));

    C = u32UsartClk;
    B = u32Baudrate;

    if ((NULL != pu32DivInteger) && (C > 0UL) && (B > 0UL)) {
        /* Smartcard mode baudrate integer calculation formula: */
        /*      B = C / (2 * BCN * (DIV_Integer + 1))           */
        /*      DIV_Integer = (C / (B * 2 * BCN)) - 1           */

        BCN = READ_REG32_BIT(USARTx->CR3, USART_CR3_BCN);
        DDL_ASSERT(IS_USART_SMARTCARD_ETU_CLK(BCN));
        BCN = au16EtuClkCnts[BCN >> USART_CR3_BCN_POS];

        DIV_Integer = (((C * 10UL) / (B * BCN * 2UL) + 5UL) / 10UL) - 1UL; /*  +5UL for rounding off */

        if (DIV_Integer <= USART_BRR_DIV_INTEGER_MAX) {
            *pu32DivInteger = DIV_Integer;

            if (NULL != pf32Error) {
                /* E(%) = C / (2 * BCN * (DIV_Integer + 1) * B) - 1 */

                /* u64Temp = 4 * (DIV_Integer + 1) * B */
                u64Temp = (uint64_t)((uint64_t)2UL * BCN * ((uint64_t)DIV_Integer + (uint64_t)1UL) * B);
                f32Err = (float32_t)((float64_t)C / (float64_t)u64Temp) - 1.0F;

                *pf32Error = f32Err;
            }

            i32Ret = LL_OK;
        }
    }

    return i32Ret;
}

/**
 * @brief  Calculate baudrate fraction division for UART mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg CM_USARTx:            USART unit instance register base
 * @param  [in] u32UsartClk             USART clock
 * @param  [in] u32Baudrate             UART baudrate
 * @param  [out] pu32DivInteger         Pointer to BRR integer divsion value
 * @param  [out] pu32DivFraction        Pointer to BRR fraction divsion value
 * @param  [out] pf32Error              E(%) baudrate error rate
 * @retval int32_t:
 *           - LL_OK:                   Set successfully.
 *           - LL_ERR_INVD_PARAM:       Set unsuccessfully.
 */
static int32_t UART_CalculateDivFraction(const CM_USART_TypeDef *USARTx, uint32_t u32UsartClk,
        uint32_t u32Baudrate, uint32_t *pu32DivInteger,
        uint32_t *pu32DivFraction, float32_t *pf32Error)
{
    uint32_t B;
    uint32_t C;
    uint32_t OVER8;
    float32_t f32Err;
    uint64_t u64Temp;
    uint64_t u64Dividend;
    uint32_t DIV_Integer;
    uint32_t DIV_Fraction;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    /* Check parameter */
    DDL_ASSERT(IS_USART_UNIT(USARTx));

    C = u32UsartClk;
    B = u32Baudrate;

    if ((NULL != pu32DivInteger) && (NULL != pu32DivFraction) && (C > 0UL) && (B > 0UL)) {
        OVER8 = (0UL == READ_REG32_BIT(USARTx->CR1, USART_CR1_OVER8)) ? 0UL : 1UL;

        /* UART mode baudrate integer calculation formula:      */
        /*      B = C / (8 * (2 - OVER8) * (DIV_Integer + 1))   */
        /*      DIV_Integer = (C / (B * 8 * (2 - OVER8))) - 1   */
        DIV_Integer = (C / (B * 8UL * (2UL - OVER8))) - 1UL;

        if (DIV_Integer <= USART_BRR_DIV_INTEGER_MAX) {
            /* UART mode baudrate fraction calculation formula:                                 */
            /*      B = C * (128 + DIV_Fraction) / (8 * (2 - OVER8) * (DIV_Integer + 1) * 256)  */
            /*      DIV_Fraction = (256 * (8 * (2 - OVER8) * (DIV_Integer + 1) * B) / C) - 128  */

            /* u64Temp = (8 * (2 - OVER8) * (DIV_Integer + 1) * B)  */
            u64Temp = (uint64_t)((uint64_t)8UL * ((uint64_t)2UL - (uint64_t)OVER8) * ((uint64_t)DIV_Integer + \
                                 (uint64_t)1UL) * (uint64_t)B);

            DIV_Fraction = (uint32_t)(256UL * u64Temp / C - 128UL);

            if (DIV_Fraction <= USART_BRR_DIV_FRACTION_MAX) {
                *pu32DivInteger = DIV_Integer;
                *pu32DivFraction = DIV_Fraction;

                if (NULL != pf32Error) {
                    /* E(%) = C * (128 + DIV_Fraction) / (256 * (8 * (2 - OVER8) * (DIV_Integer + 1) * B)) - 1 */
                    u64Temp *= (uint64_t)256UL;
                    u64Dividend = (uint64_t)C * ((uint64_t)128UL + (uint64_t)DIV_Fraction);
                    f32Err = (float32_t)((float64_t)(u64Dividend) / (float64_t)(u64Temp)) - 1.0F;

                    *pf32Error = f32Err;
                }

