RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_usart.c
                i32Ret = LL_OK;
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Calculate baudrate fraction division for clock synchronization mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg CM_USARTx:            USART unit instance register base
 * @param  [in] u32UsartClk             USART clock
 * @param  [in] u32Baudrate             UART baudrate
 * @param  [out] pu32DivInteger         Pointer to BRR integer divsion value
 * @param  [out] pu32DivFraction        Pointer to BRR fraction divsion value
 * @param  [out] pf32Error              E(%) baudrate error rate
 * @retval int32_t:
 *           - LL_OK:                   Set successfully.
 *           - LL_ERR_INVD_PARAM:       Set unsuccessfully.
 */
static int32_t ClockSync_CalculateDivFraction(const CM_USART_TypeDef *USARTx, uint32_t u32UsartClk,
        uint32_t u32Baudrate, uint32_t *pu32DivInteger,
        uint32_t *pu32DivFraction, float32_t *pf32Error)
{
    uint32_t B;
    uint32_t C;
    float32_t f32Err;
    uint64_t u64Temp;
    uint64_t u64Dividend;
    uint32_t DIV_Integer;
    uint32_t DIV_Fraction;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    /* Check parameter */
    DDL_ASSERT(IS_USART_UNIT(USARTx));

    C = u32UsartClk;
    B = u32Baudrate;

    if ((NULL != pu32DivInteger) && (NULL != pu32DivFraction) && (C > 0UL) && (B > 0UL)) {
        /* Clock sync mode baudrate integer calculation formula:    */
        /*          B = C / (4 * (DIV_Integer + 1))                 */
        /*          DIV_Integer = (C / (B * 4)) - 1                 */
        DIV_Integer = (C / (B * 4UL)) - 1UL;

        if ((DIV_Integer > 0UL) && (DIV_Integer <= USART_BRR_DIV_INTEGER_MAX)) {
            /* Clock sync mode baudrate fraction calculation formula:               */
            /*      B = C * (128 + DIV_Fraction) / (4 * (DIV_Integer + 1) * 256)    */
            /*      DIV_Fraction = 256 * (4 * (DIV_Integer + 1) * B) / C - 128       */

            /* u64Temp = (4 * (DIV_Integer + 1) * B)  */
            u64Temp = (uint64_t)((uint64_t)4U * ((uint64_t)DIV_Integer + (uint64_t)1UL) * (uint64_t)B);

            DIV_Fraction = (uint32_t)(256UL * u64Temp / C - 128UL);

            if (DIV_Fraction <= USART_BRR_DIV_FRACTION_MAX) {
                *pu32DivInteger = DIV_Integer;
                *pu32DivFraction = DIV_Fraction;

                if (NULL != pf32Error) {
                    /* E(%) = C * (128 + DIV_Fraction) / (4 * (DIV_Integer + 1) * B * 256) - 1 */
                    u64Temp *= (uint64_t)256UL;
                    u64Dividend = (uint64_t)C * ((uint64_t)128UL + (uint64_t)DIV_Fraction);
                    f32Err = (float32_t)((float64_t)(u64Dividend) / (float64_t)(u64Temp)) - 1.0F;

                    *pf32Error = f32Err;
                }

                i32Ret = LL_OK;
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Calculate baudrate fraction division for clock synchronization mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg CM_USARTx:            USART unit instance register base
 * @param  [in] u32UsartClk             USART clock
 * @param  [in] u32Baudrate             UART baudrate
 * @param  [out] pu32DivInteger         Pointer to BRR integer divsion value
 * @param  [out] pu32DivFraction        Pointer to BRR fraction divsion value
 * @param  [out] pf32Error              E(%) baudrate error rate
 * @retval int32_t:
 *           - LL_OK:                   Set successfully.
 *           - LL_ERR_INVD_PARAM:       Set unsuccessfully.
 */
static int32_t SmartCard_CalculateDivFraction(const CM_USART_TypeDef *USARTx, uint32_t u32UsartClk,
        uint32_t u32Baudrate, uint32_t *pu32DivInteger,
        uint32_t *pu32DivFraction, float32_t *pf32Error)
{
    uint32_t B;
    uint32_t C;
    uint32_t BCN;
    float32_t f32Err;
    uint64_t u64Temp;
    uint64_t u64Dividend;
    uint32_t DIV_Integer;
    uint32_t DIV_Fraction;
    const uint16_t au16EtuClkCnts[] = {32U, 64U, 93U, 128U, 186U, 256U, 372U, 512U};
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    DDL_ASSERT(IS_USART_UNIT(USARTx));

    C = u32UsartClk;
    B = u32Baudrate;

    if ((NULL != pu32DivInteger) && (NULL != pu32DivFraction) && (C > 0UL) && (B > 0UL)) {
        BCN = READ_REG32_BIT(USARTx->CR3, USART_CR3_BCN);
        DDL_ASSERT(IS_USART_SMARTCARD_ETU_CLK(BCN));
        BCN = au16EtuClkCnts[BCN >> USART_CR3_BCN_POS];

        /* Smartcard mode baudrate integer calculation formula: */
        /*      B = C / (2 * BCN * (DIV_Integer + 1))           */
        /*      DIV_Integer = (C / (B * 2 * BCN)) - 1           */
        DIV_Integer = (C / (B * BCN * 2UL)) - 1UL;

        if (DIV_Integer <= USART_BRR_DIV_INTEGER_MAX) {
            /* Smartcard mode baudrate fraction calculation formula:                        */
            /*      B = C * (128 + DIV_Fraction) / ((2 * BCN) * (DIV_Integer + 1) * 256)    */
            /*      DIV_Fraction = (256 * (2 * BCN * (DIV_Integer + 1) * B) / C) - 128      */

            /* u64Temp = (2 * BCN * (DIV_Integer + 1) * B)  */
            u64Temp = (uint64_t)((uint64_t)2UL * BCN * ((uint64_t)DIV_Integer + (uint64_t)1UL) * B);

            DIV_Fraction = (uint32_t)(256UL * u64Temp / C - 128UL);
            if (DIV_Fraction <= USART_BRR_DIV_FRACTION_MAX) {
                *pu32DivInteger = DIV_Integer;
                *pu32DivFraction = DIV_Fraction;

                if (NULL != pf32Error) {
                    /* E(%) = C * (128 + DIV_Fraction) / (4 * (DIV_Integer + 1) * B * 256) - 1 */
                    u64Temp *= (uint64_t)256UL;
                    u64Dividend = (uint64_t)C * ((uint64_t)128UL + (uint64_t)DIV_Fraction);
                    f32Err = (float32_t)((float64_t)u64Dividend / (float64_t)(u64Temp)) - 1.0F;

                    *pf32Error = f32Err;
                }
                i32Ret = LL_OK;
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Calculate baudrate fraction division for UART mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg CM_USARTx:            USART unit instance register base
 * @param  [in] u32UsartClk             USART clock
 * @param  [in] u32Baudrate             UART baudrate
 * @param  [out] pu32DivInteger         Pointer to BRR integer divsion value
 * @param  [out] pu32DivFraction        Pointer to BRR fraction divsion value
 * @param  [out] pf32Error              E(%) baudrate error rate
 * @retval int32_t:
 *           - LL_OK:                   Set successfully.
 *           - LL_ERR:                  Set unsuccessfully.
 *           - LL_ERR_INVD_PARAM:       The parameters invalid.
 */
static int32_t UART_CalculateDiv(const CM_USART_TypeDef *USARTx, uint32_t u32UsartClk,
                                 uint32_t u32Baudrate, uint32_t *pu32DivInteger,
                                 uint32_t *pu32DivFraction, float32_t *pf32Error)
{
    int32_t i32Ret = LL_ERR;

    if (!IS_USART_INTEGER_UNIT(USARTx)) {
        i32Ret = UART_CalculateDivFraction(USARTx, u32UsartClk, u32Baudrate, pu32DivInteger, pu32DivFraction, pf32Error);
    }

